Do these exercises in a notebook called `modeling.ipynb` first, then transfer the final functions to the `model.py` file.
- [x] modeling.ipynb
- [ ] model.py

In [2]:
# import python libraries
import pandas as pd
import numpy as np

# import personal libraries
import acquire
import prepare

Using the Titanic dataset

1. [x] Use the function defined in `acquire.py` to load the Titanic data.

In [4]:
titanic = acquire.get_titanic_data()
titanic.head()

Reading from file...

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [5]:
acquire.df_info(titanic)

              nunique   dtypes  isnull       sample
passenger_id      891    int64       0          611
survived            2    int64       0            0
pclass              3    int64       0            3
sex                 2   object       0         male
age                88  float64     177          NaN
sibsp               7    int64       0            0
parch               7    int64       0            0
fare              248  float64       0         7.05
embarked            3   object       2            S
class               3   object       0        Third
deck                7   object     688          NaN
embark_town         3   object       2  Southampton
alone               2    int64       0            1

2. [x] Use the function defined in `prepare.py` to prepare the titanic data.

In [7]:
titanic = prepare.prep_titanic(titanic)
titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,Southampton,1

In [8]:
acquire.df_info(titanic)

              nunique   dtypes  isnull     sample
passenger_id      891   object       0        830
survived            2   object       0          1
pclass              3   object       0          3
sex                 2   object       0     female
age                88  float64     177       15.0
sibsp               7   object       0          1
parch               7   object       0          0
fare              248  float64       0    14.4542
embark_town         3   object       2  Cherbourg
alone               2   object       0          0

In [9]:
train,validate,test = prepare.split_df(titanic,'survived')
acquire.df_info(train)

              nunique   dtypes  isnull       sample
passenger_id      534   object       0          834
survived            2   object       0            0
pclass              3   object       0            3
sex                 2   object       0         male
age                76  float64     105         18.0
sibsp               7   object       0            0
parch               6   object       0            0
fare              194  float64       0          8.3
embark_town         3   object       1  Southampton
alone               2   object       0            1

3. [X] Encode the categorical columns on train dataset. Create dummy variables of the categorical columns and concatenate them onto the dataframe. Remove the columns they are replacing. Repeat on validate and test.

In [11]:
# split sex and append it to train
train['is_male'] = pd.get_dummies(train.sex,drop_first=True).astype(int)
train

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embark_town,alone,is_male
776,776,0,3,male,NaN,0,0,7.7500,Queenstown,1,1
829,829,1,1,female,62.0,0,0,80.0000,NaN,1,0
215,215,1,1,female,31.0,1,0,113.2750,Cherbourg,0,0
258,258,1,1,female,35.0,0,0,512.3292,Cherbourg,1,0
129,129,0,3,male,45.0,0,0,6.9750,Southampton,1,1
...,...,...,...,...,...,...,...,...,...,...,...
125,125,1,3,male,12.0,1,0,11.2417,Cherbourg,0,1
360,360,0,3,male,40.0,1,4,27.9000,Southampton,0,1
55,55,1,1,male,NaN,0,0,35.5000,Southampton,1,1
298,298,1,1,male,NaN,0,0,30.5000,Southampton,1,1
768,768,0,3,male,NaN,1,0,24.1500,Queenstown,0,1

In [12]:
# split embark_town and append it to train
train[['is_Queenstown','is_Southampton']] = pd.get_dummies(train.embark_town,drop_first=True).astype(int)
train

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embark_town,alone,is_male,is_Queenstown,is_Southampton
776,776,0,3,male,NaN,0,0,7.7500,Queenstown,1,1,1,0
829,829,1,1,female,62.0,0,0,80.0000,NaN,1,0,0,0
215,215,1,1,female,31.0,1,0,113.2750,Cherbourg,0,0,0,0
258,258,1,1,female,35.0,0,0,512.3292,Cherbourg,1,0,0,0
129,129,0,3,male,45.0,0,0,6.9750,Southampton,1,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
125,125,1,3,male,12.0,1,0,11.2417,Cherbourg,0,1,0,0
360,360,0,3,male,40.0,1,4,27.9000,Southampton,0,1,0,1
55,55,1,1,male,NaN,0,0,35.5000,Southampton,1,1,0,1
298,298,1,1,male,NaN,0,0,30.5000,Southampton,1,1,0,1
768,768,0,3,male,NaN,1,0,24.1500,Queenstown,0,1,1,0

In [13]:
# drop sex and embark_town
train = train.drop(columns=['sex','embark_town'],errors='ignore')

train

,passenger_id,survived,pclass,age,sibsp,parch,fare,alone,is_male,is_Queenstown,is_Southampton
776,776,0,3,NaN,0,0,7.7500,1,1,1,0
829,829,1,1,62.0,0,0,80.0000,1,0,0,0
215,215,1,1,31.0,1,0,113.2750,0,0,0,0
258,258,1,1,35.0,0,0,512.3292,1,0,0,0
129,129,0,3,45.0,0,0,6.9750,1,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...
125,125,1,3,12.0,1,0,11.2417,0,1,0,0
360,360,0,3,40.0,1,4,27.9000,0,1,0,1
55,55,1,1,NaN,0,0,35.5000,1,1,0,1
298,298,1,1,NaN,0,0,30.5000,1,1,0,1
768,768,0,3,NaN,1,0,24.1500,0,1,1,0

In [14]:
# Reevaluate dataset
acquire.df_info(train)

                nunique   dtypes  isnull   sample
passenger_id        534   object       0      691
survived              2   object       0        1
pclass                3   object       0        3
age                  76  float64     105      4.0
sibsp                 7   object       0        0
parch                 6   object       0        1
fare                194  float64       0  13.4167
alone                 2   object       0        0
is_male               2    int64       0        0
is_Queenstown         2    int64       0        0
is_Southampton        2    int64       0        0

In [15]:
# age still has nulls
# Examine age to determine what to do with it
print(f'age mode: {train.age.mode()}')
print(f'age mean: {train.age.mean()}')
print(f'age range: {train.age.max()-train.age.min()}')

age mode: 0    19.0
Name: age, dtype: float64
age mean: 28.622773892773893
age range: 70.58

In [16]:
# it's strange that age range is a float
train.age.nsmallest(10)

803    0.42
644    0.75
469    0.75
831    0.83
305    0.92
164    1.00
386    1.00
827    1.00
172    1.00
183    1.00
Name: age, dtype: float64

In [17]:
# get proportions of nulls in age to total
train.age.isna().mean()

0.19662921348314608

In [18]:
# See how age correlates with other columns
train.corr()['age']

passenger_id      0.009966
survived         -0.080203
pclass           -0.381316
age               1.000000
sibsp            -0.333471
parch            -0.166234
fare              0.097977
alone             0.192770
is_male           0.034655
is_Queenstown    -0.045625
is_Southampton   -0.023125
Name: age, dtype: float64

In [19]:
# pclass has the highest correlation with age
# Compare binned ages against pclasses using crosstab
pd.crosstab(pd.cut(train.age,bins=5),train.pclass,dropna=False,normalize=True)*100

pclass                   1         2          3
age
NaN               3.558052  0.936330  15.168539
(0.349, 14.536]   0.374532  2.434457   7.116105
(14.536, 28.652]  4.868914  8.426966  21.535581
(28.652, 42.768]  6.367041  5.992509   9.550562
(42.768, 56.884]  5.056180  2.434457   2.808989
(56.884, 71.0]    2.247191  0.374532   0.749064

In [20]:
# apply function to get mean of a passengers age grouped by pclass
train.age = train.age.fillna(round(train.groupby('pclass').age.transform('mean'),2))
train

,passenger_id,survived,pclass,age,sibsp,parch,fare,alone,is_male,is_Queenstown,is_Southampton
776,776,0,3,24.31,0,0,7.7500,1,1,1,0
829,829,1,1,62.00,0,0,80.0000,1,0,0,0
215,215,1,1,31.00,1,0,113.2750,0,0,0,0
258,258,1,1,35.00,0,0,512.3292,1,0,0,0
129,129,0,3,45.00,0,0,6.9750,1,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...
125,125,1,3,12.00,1,0,11.2417,0,1,0,0
360,360,0,3,40.00,1,4,27.9000,0,1,0,1
55,55,1,1,38.27,0,0,35.5000,1,1,0,1
298,298,1,1,38.27,0,0,30.5000,1,1,0,1
768,768,0,3,24.31,1,0,24.1500,0,1,1,0

In [21]:
# Revisit how the dataset looks
acquire.df_info(train)

                nunique   dtypes  isnull sample
passenger_id        534   object       0    209
survived              2   object       0      1
pclass                3   object       0      1
age                  79  float64       0   40.0
sibsp                 7   object       0      0
parch                 6   object       0      0
fare                194  float64       0   31.0
alone                 2   object       0      1
is_male               2    int64       0      1
is_Queenstown         2    int64       0      0
is_Southampton        2    int64       0      0

In [22]:
# Now do this all to validate
validate['is_male'] = pd.get_dummies(validate.sex,drop_first=True).astype(int)
validate[['is_Queenstown','is_Southampton']] = pd.get_dummies(validate.embark_town,drop_first=True).astype(int)
validate = validate.drop(columns=['sex','embark_town'],errors='ignore')
validate.age = validate.age.fillna(round(validate.groupby('pclass').age.transform('mean'),2))

# Check without looking at all the data
acquire.df_info(validate)

                nunique   dtypes  isnull  sample
passenger_id        178   object       0     677
survived              2   object       0       1
pclass                3   object       0       3
age                  61  float64       0    18.0
sibsp                 6   object       0       0
parch                 4   object       0       0
fare                112  float64       0  9.8417
alone                 2   object       0       1
is_male               2    int64       0       0
is_Queenstown         2    int64       0       0
is_Southampton        2    int64       0       1

In [23]:
# Repeat with test
test['is_male'] = pd.get_dummies(test.sex,drop_first=True).astype(int)
test[['is_Queenstown','is_Southampton']] = pd.get_dummies(test.embark_town,drop_first=True).astype(int)
test = test.drop(columns=['sex','embark_town'],errors='ignore')
test.age = test.age.fillna(round(test.groupby('pclass').age.transform('mean'),2))

# Check without looking at all the data
acquire.df_info(validate)

                nunique   dtypes  isnull sample
passenger_id        178   object       0    303
survived              2   object       0      1
pclass                3   object       0      2
age                  61  float64       0   34.8
sibsp                 6   object       0      0
parch                 4   object       0      0
fare                112  float64       0  12.35
alone                 2   object       0      1
is_male               2    int64       0      0
is_Queenstown         2    int64       0      1
is_Southampton        2    int64       0      0

In [24]:
# Try to turn everything into a float
train.astype(float)

,passenger_id,survived,pclass,age,sibsp,parch,fare,alone,is_male,is_Queenstown,is_Southampton
776,776.0,0.0,3.0,24.31,0.0,0.0,7.7500,1.0,1.0,1.0,0.0
829,829.0,1.0,1.0,62.00,0.0,0.0,80.0000,1.0,0.0,0.0,0.0
215,215.0,1.0,1.0,31.00,1.0,0.0,113.2750,0.0,0.0,0.0,0.0
258,258.0,1.0,1.0,35.00,0.0,0.0,512.3292,1.0,0.0,0.0,0.0
129,129.0,0.0,3.0,45.00,0.0,0.0,6.9750,1.0,1.0,0.0,1.0
...,...,...,...,...,...,...,...,...,...,...,...
125,125.0,1.0,3.0,12.00,1.0,0.0,11.2417,0.0,1.0,0.0,0.0
360,360.0,0.0,3.0,40.00,1.0,4.0,27.9000,0.0,1.0,0.0,1.0
55,55.0,1.0,1.0,38.27,0.0,0.0,35.5000,1.0,1.0,0.0,1.0
298,298.0,1.0,1.0,38.27,0.0,0.0,30.5000,1.0,1.0,0.0,1.0
768,768.0,0.0,3.0,24.31,1.0,0.0,24.1500,0.0,1.0,1.0,0.0

4. [X] Create a function named `preprocess_titanic` that accepts the train, validate, and test titanic data, and returns the dataframes ready for modeling.

In [26]:
def preprocess_titanic(df):
    """
    Function to process and encode titanic dataset. 
    
    !!! WARNING !!! 
    This function will turn all columns into numerics for modeling. It is ill-advised to use this on your complete dataset.
    """
    # Encode sex column into binary is_male column
    df['is_male'] = pd.get_dummies(df.sex,drop_first=True).astype(int)
    
    # Encode embark_town into binary columns 'is_Queenstown' and 'is_Southampton'
    # Don't make column for Cherbourg because if Queenstown and Southampton are 0,
    # then Cherbourg must be 1
    df[['is_Queenstown','is_Southampton']] = pd.get_dummies(df.embark_town,drop_first=True).astype(int)
    
    # Drop columns that are not encoded
    df = df.drop(columns=['sex','embark_town'],errors='ignore')
    
    # Fill null values in age based on the mean age of a passenger's class
    # Based on the following lines I used to find potential correlation with other columns:
    # train.corr()['age']
    # pd.crosstab(pd.cut(train.age,bins=5),train.pclass,dropna=False,normalize=True)*100
    df.age = df.age.fillna(round(df.groupby('pclass').age.transform('mean'),2))
    
    # Encode everything as numerics
    df = df.astype(float)
    
    return df

In [27]:
# Try out the function.
# Import the titanic dataset, run the prepare, and then the preprocess function
titanic = acquire.get_titanic_data()
titanic = prepare.prep_titanic(titanic)
train,validate,test = prepare.split_df(titanic,'survived')
train_encoded = preprocess_titanic(train)
train_encoded

Reading from file...

,passenger_id,survived,pclass,age,sibsp,parch,fare,alone,is_male,is_Queenstown,is_Southampton
776,776.0,0.0,3.0,24.31,0.0,0.0,7.7500,1.0,1.0,1.0,0.0
829,829.0,1.0,1.0,62.00,0.0,0.0,80.0000,1.0,0.0,0.0,0.0
215,215.0,1.0,1.0,31.00,1.0,0.0,113.2750,0.0,0.0,0.0,0.0
258,258.0,1.0,1.0,35.00,0.0,0.0,512.3292,1.0,0.0,0.0,0.0
129,129.0,0.0,3.0,45.00,0.0,0.0,6.9750,1.0,1.0,0.0,1.0
...,...,...,...,...,...,...,...,...,...,...,...
125,125.0,1.0,3.0,12.00,1.0,0.0,11.2417,0.0,1.0,0.0,0.0
360,360.0,0.0,3.0,40.00,1.0,4.0,27.9000,0.0,1.0,0.0,1.0
55,55.0,1.0,1.0,38.27,0.0,0.0,35.5000,1.0,1.0,0.0,1.0
298,298.0,1.0,1.0,38.27,0.0,0.0,30.5000,1.0,1.0,0.0,1.0
768,768.0,0.0,3.0,24.31,1.0,0.0,24.1500,0.0,1.0,1.0,0.0

Using the Telco dataset

1. [x] Use the function defined in `acquire.py` to load the Telco data.

In [29]:
# load the telco data
telco = acquire.get_telco_data()
telco.head()

Reading from file...

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,1,2,1,0004-TLHLJ,Male,0,No,No,4,Yes,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,Yes,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

In [30]:
acquire.df_info(telco)

                          nunique   dtypes  isnull                   sample
payment_type_id                 4    int64       0                        4
internet_service_type_id        3    int64       0                        3
contract_type_id                3    int64       0                        1
customer_id                  7043   object       0               8246-SHFGA
gender                          2   object       0                     Male
senior_citizen                  2    int64       0                        0
partner                         2   object       0                       No
dependents                      2   object       0                       No
tenure                         73    int64       0                       17
phone_service                   2   object       0                      Yes
multiple_lines                  3   object       0                       No
online_security                 3   object       0      No internet service
online_backup                   3   object       0      No internet service
device_protection               3   object       0      No internet service
tech_support                    3   object       0      No internet service
streaming_tv                    3   object       0      No internet service
streaming_movies                3   object       0      No internet service
paperless_billing               2   object       0                       No
monthly_charges              1585  float64       0                     21.1
total_charges                6531   object       0                   385.55
churn                           2   object       0                       No
contract_type                   3   object       0           Month-to-month
internet_service_type           2   object    1526                      NaN
payment_type                    4   object       0  Credit card (automatic)

2. [ ] Use the function defined in `prepare.py` to prepare the Telco data.

In [32]:
telco = prepare.prep_telco(telco)
telco.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure_mths,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type,streaming,online_services,support,phone_lines
0,0002-ORFBO,Female,0,Yes,Yes,9,Yes,65.6,593.30,No,One year,DSL,Mailed check,TV,Backup,Tech Support,Single
1,0003-MKNFE,Male,0,No,No,9,No,59.9,542.40,No,Month-to-month,DSL,Mailed check,Movies,None,None,Multiple
2,0004-TLHLJ,Male,0,No,No,4,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check,None,None,Device Protection,Single
3,0011-IGKFF,Male,1,Yes,No,13,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check,Both,Backup,Device Protection,Single
4,0013-EXCHZ,Female,1,Yes,No,3,Yes,83.9,267.40,Yes,Month-to-month,Fiber optic,Mailed check,TV,None,Tech Support,Single

In [33]:
acquire.df_info(telco)

                       nunique   dtypes  isnull            sample
customer_id               7043   object       0        7799-DSEWS
gender                       2   object       0              Male
senior_citizen               2   object       0                 0
partner                      2   object       0                No
dependents                   2   object       0                No
tenure_mths                 73    int64       0                18
paperless_billing            2   object       0               Yes
monthly_charges           1585  float64       0             68.35
total_charges             6531  float64       0            1299.8
churn                        2   object       0                No
contract_type                3   object       0    Month-to-month
internet_service_type        3   object       0               DSL
payment_type                 4   object       0  Electronic check
streaming                    4   object       0                TV
online_services              4   object       0          Security
support                      4   object       0              Both
phone_lines                  3   object       0            Single

In [34]:
# # Combine streaming services
# telco['streaming']= np.select(
#     [
#     (telco['streaming_movies'] == 'Yes') & (telco['streaming_tv'] == 'Yes'),
#     (telco['streaming_movies'] == 'Yes'),
#     (telco['streaming_tv'] == 'Yes')
#     ],
#     ['Both', 'Movies', 'TV'],
#     default='None'
# )
# telco = telco.drop(columns=['streaming_tv','streaming_movies'],errors='ignore')
# telco

In [35]:
# # Combine online services
# telco['online_services']= np.select(
#     [
#     (telco['online_security'] == 'Yes') & (telco['online_backup'] == 'Yes'),
#     (telco['online_security'] == 'Yes'),
#     (telco['online_backup'] == 'Yes')
#     ],
#     ['Both', 'Security', 'Backup'],
#     default='None'
# )

# telco = telco.drop(columns=['online_security','online_backup'])
# telco

In [36]:
# # Combine device_protection and tech_support
# telco['support']= np.select(
#     [
#     (telco['device_protection'] == 'Yes') & (telco['tech_support'] == 'Yes'),
#     (telco['device_protection'] == 'Yes'),
#     (telco['tech_support'] == 'Yes')
#     ],
#     ['Both', 'Device Protection', 'Tech Support'],
#     default='None'
# )

# telco = telco.drop(columns=['device_protection','tech_support'])
# telco

In [37]:
# telco.phone_service.value_counts()

# # Combine phone service
# telco['phone_lines'] = np.select(
#     [
#     (telco['multiple_lines'] == 'No') & (telco['phone_service'] == 'Yes'),
#     (telco['multiple_lines'] == 'Yes')
#     ],
#     ['Single', 'Multiple'],
#     default='No phone service'
# )

# telco = telco.drop(columns=['multiple_lines','phone_service'])
# telco

In [81]:
telco.phone_lines.value_counts()

phone_lines
Single              3390
Multiple            2971
No phone service     682
Name: count, dtype: int64

3. Encode the categorical columns on train.
    1. [ ] Encode at least one column using `.replace`
    2. [ ] Encode at least one column using `.map`
    3. [ ] Encode the rest of the columns by creating dummy variables and concatenating them onto the dataframe.

4. [ ] Repeat the same steps on validate and test.

5. [ ] Create a function named `prep_telco` that accepts the train, validate, and test telco data, and returns the dataframes ready for modeling.